# Задача #

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Пошаговый план решения задачи:

1. Создаем возможность ввода элементов массива с помощью следующей функции:
```sh
System.Console.WriteLine("Введите элементы массива через пробел:");
```
2. Данные будут введены пользователем через пробел. Чтобы разделить введенные данные используем функцию **Split**.Выглядеть это будет следующим образом:
```sh
string[] InputArray = Console.ReadLine().Split(' ');
```
3. Создаем числовую переменную **count** равную 0. Следом используя фукцию **foreach**, пробегаемся по всему массиву **InputArray** с целью найти все элементы массива длиной менее или равной 3 символам, тем самым подсчитав размер конечного массива:
```sh
int count = 0;
    foreach (string str in InputArray)
    {
        if (str.Length <= 3)
        {
            count++;
        }
    }
```
4. Создаем новый массив строк, который будет включать в себя все элементы изначального массива с длиной меньше или равной 3 символам:
```sh
string [] OutputArray = new string[count];
```
5. Наполняем конечный массив элементами изначального массива, удовлетворяющими поставленным в задаче условиям. Предварительно подготовив к выводу сам массив с помощью функции **Concole.Writeline**:
```sh
Console.WriteLine("Новый массив:");
System.Console.WriteLine();

int index = 0;
    foreach (string str in InputArray)
    {
        if (str.Length <= 3)
        {
            OutputArray[index] = str;
            System.Console.Write(OutputArray[index] + " ");
            index++;
        }
    }
```